In [41]:
#importing the required librairies
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [42]:
df = pd.read_csv('loan_data_set.csv')
#viewing the first two 
df.head(2)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N

I would be working with this copy through out the project while the original dataframe would be for referencing when needed .

In [43]:
#making a copy of my dataset
df_c = df.copy()
df_c.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [44]:
print(f"This is the Informations Of The Dataset :\n")
df_c.info()

This is the Informations Of The Dataset :

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [45]:
#the description of the dataframe
print(f"Summary and Description Of The Dataset :\n")
df_c.describe().T

Summary and Description Of The Dataset :

,count,mean,std,min,25%,50%,75%,max
ApplicantIncome,614.0,5403.459283,6109.041673,150.0,2877.5,3812.5,5795.00,81000.0
CoapplicantIncome,614.0,1621.245798,2926.248369,0.0,0.0,1188.5,2297.25,41667.0
LoanAmount,592.0,146.412162,85.587325,9.0,100.0,128.0,168.00,700.0
Loan_Amount_Term,600.0,342.000000,65.120410,12.0,360.0,360.0,360.00,480.0
Credit_History,564.0,0.842199,0.364878,0.0,1.0,1.0,1.00,1.0

In [46]:
#the number of rows and columns 
rows, columns = df_c.shape
print(f"There are {rows} rows and {columns} columns in the dataset")

There are 614 rows and 13 columns in the dataset

In [47]:
#the unique values in csv information, 
df_c.nunique()

Loan_ID              614
Gender                 2
Married                2
Dependents             4
Education              2
Self_Employed          2
ApplicantIncome      505
CoapplicantIncome    287
LoanAmount           203
Loan_Amount_Term      10
Credit_History         2
Property_Area          3
Loan_Status            2
dtype: int64

## Data Cleaning

In [48]:
# Converting all the header name into lower case
df_c.columns = [x.lower() for x in df_c.columns]

In [49]:
df_c.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   loan_id            614 non-null    object
 1   gender             601 non-null    object
 2   married            611 non-null    object
 3   dependents         599 non-null    object
 4   education          614 non-null    object
 5   self_employed      582 non-null    object
 6   applicantincome    614 non-null    int64
 7   coapplicantincome  614 non-null    float64
 8   loanamount         592 non-null    float64
 9   loan_amount_term   600 non-null    float64
 10  credit_history     564 non-null    float64
 11  property_area      614 non-null    object
 12  loan_status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [52]:
#renaming the dataset columns for accuracy
df_c.rename(columns = {'applicantincome' : 'applicant_income',
                      'coapplicantincome' : 'coapplicant_income',
                      'loanamount' : 'loan_amount'}, inplace = True)

In [57]:
#confirming the null values in the data
df_c.isna().sum()

loan_id                0
gender                13
married                3
dependents            15
education              0
self_employed         32
applicant_income       0
coapplicant_income     0
loan_amount           22
loan_amount_term      14
credit_history        50
property_area          0
loan_status            0
dtype: int64

In [65]:
#checking the percentage of missing values
percent_missing = round(df_c.isnull().sum() * 100 / len(df), 2).sort_values(ascending = False)
percent_missing

credit_history        8.14
self_employed         5.21
loan_amount           3.58
dependents            2.44
loan_amount_term      2.28
gender                2.12
married               0.49
loan_id               0.00
education             0.00
applicant_income      0.00
coapplicant_income    0.00
property_area         0.00
loan_status           0.00
dtype: float64

In [80]:
#replacing the null values in the columns
for col in df_c:
    #check if it is a number
    if df_c[col].dtype == 'float64' or df_c[col].dtype == 'int':
        df_c[col].fillna(df_c[col].median(), inplace = True)
        
    else:
        df_c[col].fillna(df_c[col].mode()[0], inplace = True)

In [81]:
#confirming the null values in the data
df_c.isna().sum()

loan_id               0
gender                0
married               0
dependents            0
education             0
self_employed         0
applicant_income      0
coapplicant_income    0
loan_amount           0
loan_amount_term      0
credit_history        0
property_area         0
loan_status           0
dtype: int64